# BackgroundColor Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
ViewDisplayBackground..::..BackgroundColor Property
ViewDisplayBackground Class See Also
---
The color of the horizon when the type is 'Gradient'.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2014
# Syntax
C#
---
```text
public Color BackgroundColor { get; }
```

Visual Basic
---
```text
Public ReadOnly Property BackgroundColor As Color
	Get
```

Visual C++
---
```text
public:
property Color^ BackgroundColor {
	Color^ get ();
}
```

# See Also
ViewDisplayBackground Class
Autodesk.Revit.DB Namespace